# CurrentConstruction Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPSpaceConstruction..::..CurrentConstruction Property
MEPSpaceConstruction Class See Also
---
Get all the Building Constructions according to the specific Construction type.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public MEPBuildingConstruction CurrentConstruction { get; set; }
```

Visual Basic
---
```text
Public Property CurrentConstruction As MEPBuildingConstruction
	Get
	Set
```

Visual C++
---
```text
public:
property MEPBuildingConstruction^ CurrentConstruction {
	MEPBuildingConstruction^ get ();
	void set (MEPBuildingConstruction^ value);
}
```

# Remarks
This property is used to get or set the Building Service of the Project Information.
# See Also
MEPSpaceConstruction Class
Autodesk.Revit.DB.Mechanical Namespace